import { Box, Typography } from "@mui/material"

export const mainTabYourReqText = `
هر چیزی لازم داری با زدن دکمه درخواست جدید اعلام کن هر چقدر کارهای
بیشتری از درخواست های دیگران انجام بدی دیگران هم درخواست های بیشتری برای
شما انجام خواهند داد
`
export const selectGuild = `
کسب و کاری که ثبت می کنید با چه صنفی مرتبط است؟

`
export const iconText = `
هر کاربر می تواند تا سقف 3 کسب و کار عضو باشد 
یک کسب و کار اصلی و دو تای دیگر فرعی خواهند بود
زمانی که محصولی از دیگران دریافت می کنید این به حساب کسب و کار اصلی شما ثبت می شود 
و زمانی که درخواست محصول ایجاد می کنید دیگران با توجه به کسب و کار اصلی شما در خصوص ارئه محصول به شما تصمیم گیری خواهند کرد 
جهت جلوگیری از ایجاد سوابق سوری، تغییر کسب و کار اصلی تنها هر 14 روز امکانپذیر است

`
export const resignationText1 = `
شما در کسب و کاری که برای استعفا از آن اقدام نموده اید تنها هستید! 
کسب و کارها قابل حذف نیستند و همیشه یک نفر عضو باید در آنها باقی بماند
برای تغییر شغل می توانید مشخصات کسب و کار خود بصورت کامل ویرایش نمایید
در صورت اصرار به استعفا باید یک نفر را استخدام نموده و مجدد به این بخش بازگردید

`
export const resignationText2 = `
شما بعنوان نماینده کسب و کار بایستی قبل از استعفا جانشین خود را انتخاب نمایید
کدکاربری جانشین خود را که باید عضو همین کسب و کار باشد را وارد نمایید
`
export const OthersRequestText = `
گزینه های مربوط به پاسخ تنها به کاربرانی که نماینده کسب و کار اصلی خود هستند نمایش داده می شود
همچنین اطلاعات مربوط به کسب و کار متقاضی تنها به افرادی نمایش داده می شود که صنف تعیین شده در درخواست مشتری با حداقل یکی از صنف های کسب و کارهای 
تامین کننده برابر باشد
`
export const FirtstTabText = `
در این صفحه کسب و کارهایی که به ارائه محصولات و خدمات خود به کسب و کار شما متعهد شده اند را مشاهده می نمایید
جهت دریافت محصولات مورد نیاز خود با آنها هماهنگ کنید
`
export const createBusiness_selectAsPrimary = () => {

    return <Box sx={{ py: 1, textAlign: "center" }}>
        <Typography>
            داشتن چند شغل و عضویت در چند کسب و کار مختلف تا سقف 3 عدد مجاز است اما محصولاتی که دریافت می کنید به حساب کسب و کار اصلی شما منظور می شود
        </Typography>
        <Typography>
            تغییر کسب و کار اصلی تنها هر 14 روز یکبار امکانپذیر است
        </Typography>
    </Box>
}
export const AllBusinessesText = () => {

    return <Box sx={{ py: 1, textAlign: "center" }}>
        <Typography sx={{ fontSize: 14 }}>
            برای نمایش کسب و کارها بر اساس فاصله بایستی اجازه دسترسی به GPS را تایید نمایید
        </Typography>
        <Typography sx={{ fontSize: 14 }}>
            توجه داشته باشید موقعیت مکانی که در این صفحه مشخص می کنید جایی ذخیره نمی شود و برای محاسبه و نمایش نزدیکترین کسب و کارها در همین صفحه کاربرد دارد
        </Typography>
    </Box>
}


